import frozen from "assets/images/cartoons/frozen.jpeg";
import anastasia from "assets/images/cartoons/anastasia.jpg";
import kungFu from "assets/images/cartoons/kung-fu.jpg";
import ice from "assets/images/cartoons/ice.jpg";
import grinch from "assets/images/cartoons/grinch.jpg";
import secret from "assets/images/cartoons/secret.jpg";
import micky from "assets/images/cartoons/micky.jpg";
import rise from "assets/images/cartoons/rise.jpg";
import tomAndJerry from "assets/images/cartoons/tom-and-jerry.jpg";
import twelveMonth from "assets/images/cartoons/twelve-month.jpg";

const cartoonItems = [
  {
    id: "1",
    image: frozen,
    title: "Холодное сердце",
    text: "Мультик про сказочное королевство, которое погрузилось в вечную зиму, а снять проклятие может только принцесса Эльза. На поиски Эльзы отправляется родная сестра Эльзы Анна в компании Кристофера, Свена и Олафа. Есть продолжение - Холодное сердце 2 и несколько короткометражных картин.",
  },
  {
    id: "2",
    image: anastasia,
    title: "Анастасия",
    text: "Анастасия, дочь последнего русского царя, чудом осталась жива после революции, но не знает, кто она и откуда. Чудеса начинаются, когда она приезжает в Париж, находит бабушку и попадает на настоящий бал.",
  },
  {
    id: "3",
    image: kungFu,
    title: "Кунг‑фу Панда: праздничный выпуск",
    text: "Сюжет рассказывает о доброй традиции По устраивать шумный праздник для всех жителей своей деревни. Но в этот год все под угрозой, потому что ему пришло поручение организовать торжество в Нефритовом дворце. Заодно можно пересмотреть серию мультиков про приключения панды По и его друзей.",
  },
  {
    id: "4",
    image: ice,
    title: "Ледниковый период: гигантское Рождество",
    text: "Ледниковый период - серия мультфильмов, одна из самых популярных историй среди детей, которые можно пересматривать много раз. В новогодней истории, как и всегда, Сид встревает в приключения, и он решает встретиться с главным дедушкой Рождества лично, чтобы принести свои извинения и получить заветный подарок.",
  },
  {
    id: "5",
    image: grinch,
    title: "Гринч",
    text: "Сюжет рассказывает о Гринче, который терпеть не может Рождество и не понимает, почему все ему радуются. По мере приближения праздника угрюмый главный герой становится все мрачнее, видя веселье окружающих и праздничную суету.",
  },
  {
    id: "6",
    image: secret,
    title: "Секретная служба Санта-Клауса",
    text: "Этот новогодний мультик для детей, которые не верят в Деда Мороза и Санта-Клауса. Мультфильм не только рассказывает о торжестве добра, но и приоткрывает завесу тайны о том, как Санта-Клаусу удается доставить миллионы подарков за одну ночь и ничего не перепутать.",
  },
  {
    id: "7",
    image: micky,
    title: "Волшебное Рождество у Микки",
    text: "Начинается снежная буря, которая заносит Мышиный домик полностью. Так как выбраться нельзя, решено отпраздновать Рождество у Микки. И Микки принимает решение устроить новогодний марафон мультфильмов, которые показывают, что Рождество — это действительно классный праздник.",
  },
  {
    id: "8",
    image: rise,
    title: "Хранители снов",
    text: "Хранители снов — волшебные существа, которые охраняют детские мечты и их веру в чудеса. Они работают отдельно, но когда над детьми нависает реальная угроза, решают объединиться. Злой Кромешник решил разрушить детскую веру в чудеса. Если ему это удастся, в мире воцарится тьма и уныние, поэтому Хранители снов храбро встают на защиту своих подопечных.",
  },
  {
    id: "9",
    image: tomAndJerry,
    title: "Том и Джерри: история о Щелкунчике",
    text: "Джерри, попав в пустой оперный зал, загадывает стать известным исполнителем. Его желание сбывается, и он попадает в волшебную страну. Но сТом приводит стаю бездомных котов, которые врываются в волшебное царство и похищают балерину из коробки, с которой танцевал Джерри. Теперь ему нужно спасти друзей и восстановить волшебство.",
  },
  {
    id: "10",
    image: twelveMonth,
    title: "Двенадцать месяцев",
    text: "Один из самых старых и добрых мультиков про Новый год и Рождество, который смотрели еще наши родители в детстве. Королева хочет корзину подснежников в обмен на золото, хотя на дворе стоит лютая зима. Одна жадная крестьянка отправляет в лес свою падчерицу и говорит не возвращаться без подснежников. Девочка знакомится с Братьями-Месяцами, каждый из которых показывает ей, на что они способны.",
  },
];

export default cartoonItems;
