import italy from "assets/images/flags/italy.png";
import finland from "assets/images/flags/finland.png";
import sweden from "assets/images/flags/sweden.png";
import france from "assets/images/flags/france.png";
import spain from "assets/images/flags/spain.png";
import britain from "assets/images/flags/britain.png";
import scotland from "assets/images/flags/scotland.png";
import japan from "assets/images/flags/japan.png";
import australia from "assets/images/flags/australia.png";

const worldTraditionsItems = [
  {
    id: "1",
    image: italy,
    country: "Италия",
    text: "В Новый год итальянцы избавляются от старых вещей, выбрасывая их прямо в окна, согласно средневековым традициям. Этот обычай соблюдается в деревнях. Вместо Деда Мороза подарки детям раздаёт Фея Бефана, которая летает на метле. Однако в Италии также есть волшебный дедушка по имени Баббо Натале. На празднике итальянцы едят чечевицу, орехи и виноград, которые символизируют здоровье, изобилие и долгую жизнь.",
  },
  {
    id: "2",
    image: finland,
    country: "Финляндия",
    text: "Для финнов самыми любимыми блюдами на новогоднем столе являются сладкая рисовая каша и варенье из слив. Финского Деда Мороза называют Йоулупукки, что переводится как рождественский козел. Этот добрый дедушка перемещается на запряженной козлами повозке. Он обладает отличным слухом, поэтому лучше шептать ему свои желания, чтобы злой дух не узнал о них.",
  },
  {
    id: "3",
    image: sweden,
    country: "Швеция",
    text: "В преддверии Нового года шведские дети проводят торжественные выборы королевы света, Лючии. Она одевается в белое платье с короной, украшенной горящими свечами. Лючия щедро угощает домашних животных и дарит подарки детям. Весь праздник сопровождается яркими огнями, которые горят на улицах и в домах, принося волшебную атмосферу света.",
  },
  {
    id: "4",
    image: france,
    country: "Франция",
    text: "Во Франции перед 31 декабря французы украшают свои дома фигурками из дерева и глины. Пер Ноэль оставляет подарки в обуви детям. В новогоднюю ночь королем становится ребёнок, который находит внутри праздничного пирога фасоль или боб. Символом благополучия и семейного очага является большое полено, которое зажигается в каминах домов.",
  },
  {
    id: "5",
    image: spain,
    country: "Испания",
    text: "На Новый год у каждого испанца есть ритуал - съесть 12 виноградин под звуки местных курантов. Считается, что это приносит удачу на весь следующий год. В магазинах даже продают специальные банки с виноградинами без семечек и кожи. Ещё одна интересная традиция - нужно встречать Новый год в красном нижнем белье, чтобы не было материальных проблем весь год.",
  },
  {
    id: "6",
    image: britain,
    country: "Великобританмя",
    text: "В Великобритании люди играют сцены из сказок, устраивают карнавалы и посещают уличные ярмарки. Дети готовят тарелку для подарков вместо чулка. Почти в полночь звон колокола объявляет о наступлении Нового года. Влюбленные в этот момент целуются под омелой, веря, что это защитит их от расставания в течение следующих 12 месяцев. На праздничном столе в Англии присутствует индейка с картофелем, каштанами и соусом. В качестве десерта подаются фрукты и пудинг.",
  },
  {
    id: "7",
    image: scotland,
    country: "Шотландия",
    text: "Хогмани - шотландский Новый год, который отмечается праздником огня. Во время этого праздника участники сжигают бочки, наполненные дегтем и символизирующие старый год. В Шотландии первым желанным гостем 1 января в доме является брюнет, который переступает порог с подарками. Считается, что мужчина с темными волосами принесет удачу. Гости, приходящие на праздник, должны принести с собой уголь, чтобы бросить его в камин и привлечь удачу.",
  },
  {
    id: "8",
    image: japan,
    country: "Япония",
    text: "В Японии на Новый год люди одеваются в новую одежду, чтобы привлечь удачу и защититься от неприятностей. Вместо традиционной елки используются мотибана - небольшие деревья, украшенные ветками сосны, которые также украшают двери. Особое значение имеют бамбуковые ростки и ветки, а также миниатюрные персиковые и сливовые деревья. В новогоднюю ночь каждый японец мечтает услышать 108 колокольных ударов, что символизирует желание стать лучше и избавиться от негативных эмоций.",
  },
  {
    id: "9",
    image: australia,
    country: "Австралия",
    text: "В стране кенгуру Новый год выпадает на австралийское лето. Зимнего снега там нет, поэтому Дед Мороз появляется на пляжах Сиднея в своем плавательном костюме на специальном ярко украшенном сёрфе. Он сохраняет классический облик со своей белой бородой и красной шапочкой с помпончиком. Во всех штатах отмечают Новый год весело и шумно. 1 января австралийцы отправляются на пляж, где наслаждаются серфингом и танцами, а также устраивают пикники.",
  },
];

export default worldTraditionsItems;
