import charlie from "assets/images/movies/charlie.jpg";
import chronicles from "assets/images/movies/hroniki-narnii.jpg";
import garryPotter from "assets/images/movies/garry-potter.jpg";
import homeAlone from "assets/images/movies/home-alone.png";

const moviesItems = [
  {
    id: "1",
    image: chronicles,
    title: "Хроники Нарнии",
    text: "Питер, Сьюзен, Эдмунд и Люси находят платяной шкаф, который ведет в волшебную страну Нарнию, освобождают Нарнию от заклятия Белой Колдуньи и продолжают приключения. Трилогия фильмов по произведениям Клайва Льюиса из серии Хроники Нарнии.",
  },
  {
    id: "2",
    image: garryPotter,
    title: "Гарри Поттер",
    text: "Серия фильмов, основанных на книгах о Гарри Поттере английской писательницы Дж. К. Роулинг. Гарри поступает в школу магии Хогвартс, заводит друзей и борется со злом. Во всех фильмах о Гарри Поттере Рождество показано поистине волшебно.",
  },
  {
    id: "3",
    image: homeAlone,
    title: "Один дома",
    text: "История про мальчика Кевина, который в канун Рождества остался дома один. Пользуясь случаем, он веселится по полной программе и спасает дом от грабителей. В оригинальной истории два фильма про Кевина.",
  },
  {
    id: "4",
    image: charlie,
    title: "Чарли и шоколадная фабрика",
    text: "Фильм про Чарли, мальчика из бедной семьи, который не верит своему везению: он – один из пяти счастливчиков, выигравших экскурсию на конфетную фабрику Вилли Вонка.",
  },
];

export default moviesItems;
